api-management/apis/legacy-catalog-soap-api_v1CSAM4I/operations/POST___soapAction=http___tITII96.request.text_xml.html

<?xml version="1.0" encoding="utf-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <CreateAvailableStock xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://tempuri.org/">
      <catalogItemsStock>
        <AvailableStock xmlns="http://schemas.datacontract.org/2004/07/eShopWCFService">1</AvailableStock>
        <CatalogItemId xmlns="http://schemas.datacontract.org/2004/07/eShopWCFService">1</CatalogItemId>
        <Date xmlns="http://schemas.datacontract.org/2004/07/eShopWCFService">1900-01-01T01:01:01</Date>
        <StockId xmlns="http://schemas.datacontract.org/2004/07/eShopWCFService">1</StockId>
      </catalogItemsStock>
    </CreateAvailableStock>
  </Body>
</Envelope>